{
	"contentlets": [{
		"newsAndEventsWidgetEnable": false,
		"pr": "PR",
		"Image": "",
		"doesNotExpire": "Yes",
		"imageCaption": "",
		"locked": false,
		"contentType": "newsItem",
		"newsAndEventsWidgetHeadline": "",
		"audience": "Home",
		"additionalImage1": "",
		"NewsPublishDate": "2020-06-11 11:15:00.0",
		"additionalImage2": "",
		"NewsSummary": "FORT WAYNE, Ind.—Every week, clients of Purdue University Fort Wayne’s Community Counseling Center continue to receive mental health services, even as the COVID-19 pandemic remains active.",
		"numberOfVotes1": 0,
		"hasTitleImage": true,
		"sortOrder": 0,
		"averageRating1": 0,
		"NewsBody": "<p>FORT WAYNE, Ind.&mdash;Every week, clients of Purdue University Fort Wayne&rsquo;s Community Counseling Center continue to receive mental health services, even as the COVID-19 pandemic remains active.<\/p>\n<p>In March, during the university&rsquo;s &ldquo;extended spring break,&rdquo; which preceded the closing of campus and limiting access to only essential employees, faculty members in the School of Education&rsquo;s Counselor Education Department quickly began researching telehealth platforms, HIPAA policies, best practices, and documentation procedures. They were looking for a way the Community Counseling Center could remain open, yet keep everyone safe from the pandemic.<\/p>\n<p>&ldquo;The clinic had to remain open; it was simply not an option to close the counseling center, because our clients deserved continuity of care and to continue work with counselors they had come to trust,&rdquo; said Kerrie Fineran, director of counselor education at Purdue Fort Wayne. &ldquo;The faculty made it happen with the help of a variety of university offices, including our dean&rsquo;s office in the College of Professional Studies, Information Technology Services, Purdue Legal, Development, Academic Affairs, and the Office of Sponsored Programs,&rdquo; Fineran added.<\/p>\n<p>The clients &ldquo;meet&rdquo; with their regular counselor via telehealth systems the center was able to obtain, thanks in part to a Federal Communications Committee grant of nearly $35,000.<\/p>\n<p>Those funds, which are part of the federal CARES Act, allowed the center to buy tablets, keyboards, and other online accessories for all the counselors. The new equipment will only be used for counseling center work, improving equipment issues, and enhancing confidentiality.<\/p>\n<p>&ldquo;Ninety percent of our clients were able to remain in contact with their counselors through our telehealth counseling,&rdquo; noted Brooke Sellhorn, clinical director of the center. &ldquo;Some of those who were not able to continue due to connectivity issues will be able to reengage with counseling since we will have loaner equipment thanks to the grant,&rdquo; added Fineran.<\/p>\n<p>The clients aren&rsquo;t the only ones benefitting from the grant: the counselors, who are second-year graduate students in the counselor education program, have learned a new set of skills. The students were trained to use video and audio on an online platform, to maintain confidentiality, and to document notes in an online medical record system.<\/p>\n<p>&ldquo;I am so thankful for how seemingly effortless our professors and clinic staff have transitioned to telehealth services. Because of this, I am able to connect with clients who may have otherwise gone without counseling for an unknown period of time,&rdquo; stated Timothy Hill, a second-year clinical mental health student who is currently seeing clients via telehealth. Hill went on to say, &ldquo;On a professional level, I found this experience valuable, since I might not have tried out telehealth services on my own. I am grateful the program was able to adapt to circumstances as unforeseen as a pandemic.&rdquo;<\/p>\n<p>Another of the second-year graduate students who also sees clients, Nealum Ibrahim, agrees with Hill. &ldquo;Working in the clinic and transitioning to telehealth was surprisingly easy for most clients. I think the clients were eager to connect and felt safe and natural in using the new system. Some clients also preferred it to in-person counseling because of the flexibility in scheduling.&rdquo;<\/p>\n<p>Joel Givens, assistant professor of counselor education and a supervisor of the student-counselors, is pleased with the transition. &ldquo;Although I was initially concerned about the transition from in-person to online, I was pleasantly surprised that the students adapted so effortlessly to a telehealth format. They were flexible, patient with technical problems, and fully engaged in the learning process,&rdquo; he said. &ldquo;Within a few weeks, the students were empathically responding to clients who presented to the online sessions with feelings of loneliness, sadness, and fear.&rdquo;<\/p>\n<p>Purdue Fort Wayne&rsquo;s Community Counseling Center offers free services to individuals, couples, and families experiencing personal problems, adjustment reactions, or career-counseling concerns. For more information, or to set up an appointment, call 260-481-5405.<\/p>\n<p>For more information on the counselor education program and\/or the counseling center&rsquo;s transition to online services, contact Fineran at&nbsp;<a href=\"mailto:finerank@pfw.edu\">finerank@pfw.edu<\/a> or 940-735-1311.<\/p>",
		"modDate": "2020-06-11 11:29:14.355",
		"NewsHeadline": "Community Counseling Center at Purdue Fort Wayne receives CARES Act funding; allows continuation of services despite COVID-19 pandemic",
		"commentscount": "0",
		"title": "Community Counseling Center at Purdue Fort Wayne receives CARES Act funding; allows continuation of services despite COVID-19 pandemic",
		"keyInfo": "<ul>\n<li>Community Counseling Center receives CARES Act funds<\/li>\n<li>Money allows center to continue services during COVID-19 pandemic<\/li>\n<li>Clients meet with counselors online<\/li>\n<li>Services are free and open to the public<\/li>\n<\/ul>",
		"baseType": "CONTENT",
		"archived": false,
		"showLastModified": "",
		"averageRating": 0,
		"working": true,
		"newsAndEventsWidgetImage": "",
		"departments": "Professional Studies",
		"imagePhotographer1": "",
		"live": true,
		"imagePhotographer2": "",
		"numberOfVotes": 0,
		"topMess": "1",
		"topics": "Education",
		"languageId": 1,
		"newsAndEventsWidgetLeadText": "",
		"url": "",
		"titleImage": "Image",
		"imagePhotographer": "",
		"imageCaption2": "Joel Givens",
		"imageCaption1": "Brooke Sellhorn"
	}, {
		"newsAndEventsWidgetEnable": false,
		"pr": "PR",
		"Image": "",
		"doesNotExpire": "Yes",
		"imageCaption": "",
		"tag": "food insecurity,food desert",
		"locked": false,
		"contentType": "newsItem",
		"newsAndEventsWidgetHeadline": "Food Insecurity Summit",
		"audience": "Home, Alumni & Friends, Current Students, Faculty & Staff",
		"additionalImage1": "",
		"NewsPublishDate": "2020-02-13 08:20:00.0",
		"additionalImage2": "",
		"NewsSummary": "FORT WAYNE, Ind.—Student organizations in the College of Professional Studies at Purdue University Fort Wayne will host a Food Insecurity Summit on Thursday, February 20.",
		"numberOfVotes1": 0,
		"hasTitleImage": true,
		"sortOrder": 0,
		"averageRating1": 0,
		"NewsBody": "<p>FORT WAYNE, Ind.&mdash;Food insecurity is defined by the Oxford Dictionary as &ldquo;that state of being without reliable access to a sufficient quantity of affordable, nutritious food.&rdquo; In Allen County Indiana, the 2017 Feeding America report found that food insecurity affects 13.3% of people in Allen County, with that number increasing to 17.2% for children.<\/p>\n<p>To shed light on the problem and possible solutions, the student organizations in the College of Professional Studies at Purdue University Fort Wayne will host&nbsp;a Food Insecurity Summit on&nbsp;Thursday, Feb. 20. The Summit is an opportunity for the public to learn about this issue and what can be done to help. Those attending will also experience the dining limitations of families living in food deserts, several of which are scattered around Fort Wayne and Allen County.<\/p>\n<p>The summit will be facilitated by Patricia Eber, professor and chair of the Department of Human Services, and Eric Manor, director of wellness and fitness and the Pantry at Purdue Fort Wayne. Additionally, a panel of community experts on food insecurity will discuss the issue. Panel members are:<\/p>\n<ul>\n<li>Jered Blanchard, community wellness coordinator, Purdue Extension Office<\/li>\n<li>Laura Dwire, community programs manager, St. Joseph Community Health Foundation<\/li>\n<li>Kathy Wehrle, lead community outreach registered dietitian nutritionist, certified lifestyle medicine practitioner, Parkview Health<\/li>\n<\/ul>\n<p>Six resource tables from community agencies will offer further information to summit-goers.<\/p>\n<p>The summit will be from 6 to 8 p.m. in the Classic Ballroom, located in Walb Student Union on the Purdue Fort Wayne campus. It is free and open to the public.<\/p>\n<p>The student organizations which are collaborating on the summit are:<\/p>\n<ul>\n<li>Chi Eta Sigma&mdash;Counselor Education program in the School of Education<\/li>\n<li>Tau Upsilon Alpha&mdash;Department of Human Services<\/li>\n<li>Hospitality Management Association&mdash;Department of Hospitality and Tourism Management<\/li>\n<li>Kappa Delta Pi&mdash;Educational Leadership graduate program and Undergraduate Teacher preparation program in the School of Education&nbsp;&nbsp;&nbsp;<\/li>\n<li>Pi Alpha Alpha&mdash;Department of Public Policy&nbsp;<\/li>\n<\/ul>\n<p>For more information, contact Sharon Parnin, clinical assistant professor, at 260-481-6063 or <a href=\"mailto:parnins@pfw.edu\">parnins@pfw.edu<\/a>.<\/p>",
		"modDate": "2020-02-20 14:43:26.417",
		"NewsHeadline": "Food Insecurity Summit at Purdue University Fort Wayne to explore the problem and possible solutions",
		"commentscount": "0",
		"title": "Food Insecurity Summit at Purdue University Fort Wayne to explore the problem and possible solutions",
		"keyInfo": "<ul>\n<li>Food Insecurity Summit<\/li>\n<li>Thursday, Feb. 20, 6&ndash;8 p.m.<\/li>\n<li>Classic Ballroom, Walb Student Union<\/li>\n<li>Free and open to the public<\/li>\n<\/ul>",
		"baseType": "CONTENT",
		"archived": false,
		"showLastModified": "",
		"averageRating": 0,
		"working": true,
		"newsAndEventsWidgetImage": "",
		"departments": "Human Services, Professional Studies",
		"imagePhotographer1": "",
		"live": true,
		"imagePhotographer2": "",
		"numberOfVotes": 0,
		"topMess": "1",
		"topics": "Public Affairs",
		"languageId": 1,
		"newsAndEventsWidgetLeadText": "Food insecurity affects 13.3 percent of Allen County’s population. Learn about the issue and what you can do to help, while experiencing the dining limitations of families living in food deserts.",
		"url": "",
		"titleImage": "Image",
		"imagePhotographer": "",
		"imageCaption2": "",
		"imageCaption1": ""
	}, {
		"newsAndEventsWidgetEnable": true,
		"pr": "PR",
		"Image": "",
		"doesNotExpire": "Yes",
		"imageCaption": "",
		"locked": false,
		"contentType": "newsItem",
		"newsAndEventsWidgetHeadline": "AEP Foundation Awards Purdue Fort Wayne $300,000 grant for STEAM Training",
		"audience": "Home, Alumni & Friends, Current Students, Faculty & Staff",
		"additionalImage1": "",
		"NewsPublishDate": "2020-02-20 11:20:00.0",
		"additionalImage2": "",
		"NewsSummary": "FORT WAYNE, Ind.—Enhanced professional development for teachers who specialize in science, technology, engineering, arts, and math is the aim of a $300,000 grant announced Thursday on the campus of Purdue University Fort Wayne.",
		"numberOfVotes1": 0,
		"hasTitleImage": true,
		"sortOrder": 0,
		"averageRating1": 0,
		"NewsBody": "<p>FORT WAYNE, Ind.&mdash;Enhanced professional development for teachers who specialize in science, technology, engineering, arts, and math is the aim of a $300,000 grant announced Thursday on the campus of Purdue University Fort Wayne. Toby Thomas, president and chief operating officer of Indiana Michigan Power, presented the award to the university on behalf of the AEP Foundation.<\/p>\n<p>Thomas joined leaders from Purdue Fort Wayne and students from Paul Harding Junior High School at the Steel Dynamics Keith E. Busse Mastodon Alumni Center to celebrate the occasion and to discuss how this type of curriculum is used throughout the school year.<\/p>\n<p>&ldquo;I&amp;M and the AEP Foundation are strong, enthusiastic supporters of STEAM education,&rdquo; Thomas said. &ldquo;Teaching science, technology, engineering, arts, and math to impressionable middle and high school students is a vital link in our education system, and we are pleased to support this initiative of the Purdue Fort Wayne School of Education.&rdquo;<\/p>\n<p>Funding from the three-year grant will be used for a program called Project EZ: Green STEAM Tech. Its main objective is to educate teachers about &ldquo;green energy&rdquo; technologies and robotics through hands-on skills labs and the implementation of best practices.<\/p>\n<p>During six-week summer sessions, approximately 15 middle and high school teachers per year will have access to state-of-the-art professional development opportunities led by Jeff Nowak, a professor of STEAM education in the College of Professional Studies. Project EZ will help participants become more knowledgeable and comfortable with collaborative technology tools so they may inspire thousands of students to new career options.<\/p>\n<p>&ldquo;The potential of this program to positively impact not only the 46 educators who will take part, but also the more than 10,000 students they will collectively teach over the following three years, is exciting to consider,&rdquo; Nowak said. &ldquo;The equipment and kits being made available will allow the participating teachers to build the requisite skills they&rsquo;ll need to attain a transformational understanding of how to share this knowledge with their students in the classroom. We are fortunate to have the AEP Foundation share our desire to bolster STEAM education across northeastern Indiana.&rdquo;<\/p>\n<p>Project EZ will be offered to middle school teachers this summer, high school teachers in 2021, and to a combination of both in 2022. The program will also provide the opportunity for participants to earn points that may be applied to a <a href=\"https:\/\/www.doe.in.gov\/sites\/default\/files\/news\/professional-growth-plan-pgp-faq-1-final-may-17.pdf\">Professional Growth Plan<\/a>, which is one option for the renewal of an educator license in Indiana.<\/p>\n<p>Leaders from Purdue Fort Wayne used the ceremonial check presentation, which included a robotics demonstration from seven Harding students, to stress the important role this grant and other forms of public support play in the university&rsquo;s ability to offer high-quality educational opportunities for students and educators.&nbsp;<\/p>\n<p>&ldquo;Partnerships such as this highlight the return on investment that&rsquo;s possible when the business sector and public higher education combine resources,&rdquo; said Ruth L. Stone, vice chancellor for development, Purdue Fort Wayne. &ldquo;Together, the AEP Foundation and Purdue Fort Wayne are expanding the reach of STEAM education throughout our region. Benefits will be evident for years to come as the teachers we support continue to inspire their students to reach higher with their academic pursuits.&rdquo;<\/p>\n<p>The AEP Foundation grant makes up nearly 70% of the total funding for Project EZ. Purdue Fort Wayne will cover the rest. In addition to course materials, grant money will also be used to purchase three pedal assist e-bikes for use by the public while on display at multiple locations throughout the region, and for the replacement of existing equipment offered through the NISTEM Education Resource Center at Purdue Fort Wayne.<\/p>\n<p>Middle school STEAM teachers interested in applying for the summer 2020 session of Project EZ are invited to contact Nowak directly at <a href=\"mailto:nowakj@pfw.edu\">nowakj@pfw.edu<\/a> or 260-481-6960 to learn more.&nbsp;&nbsp;<\/p>\n<p>Media contacts:<\/p>\n<ul>\n<li>Tracy Warner, Indiana Michigan Power, 260-408-3420 (office), 260-479-9484 (mobile), <a href=\"mailto:tkwarner@aep.com\">tkwarner@aep.com<\/a><\/li>\n<li>Geoff Thomas, Purdue University Fort Wayne, 260-481-4106 (office), 260-437-7657&nbsp;(mobile), <a href=\"mailto:geoff.thomas@pfw.edu\">geoff.thomas@pfw.edu<\/a><\/li>\n<\/ul>\n<p><strong>About the AEP Foundation<\/strong><\/p>\n<p>The AEP Foundation is funded by American Electric Power and its utility operating units, including Indiana Michigan Power. The Foundation focuses on improving lives through education from early childhood through higher education in the areas of science, technology, engineering, math, and the environment and by meeting basic needs for emergency shelter, affordable housing, and the elimination of hunger.<\/p>\n<p><strong>About Indiana Michigan Power<\/strong><\/p>\n<p>Indiana Michigan Power (I&amp;M) is headquartered in Fort Wayne, and its 2,450 employees serve more than 593,900 customers. More than half of its generation is emission-free, including 2,278 MW of nuclear generation in Michigan, 450 MW of purchased wind generation from Indiana, 22 MW of hydro generation in both states, and approximately 15 MW of large-scale solar generation in both states. The company&rsquo;s generation portfolio also includes 2,600 MW of coal-fueled generation in Indiana.<\/p>",
		"modDate": "2020-02-20 14:17:09.384",
		"NewsHeadline": "AEP Foundation awards Purdue Fort Wayne $300,000 grant for STEAM teacher training",
		"commentscount": "0",
		"title": "AEP Foundation awards Purdue Fort Wayne $300,000 grant for STEAM teacher training",
		"keyInfo": "<ul>\n<li><strong><\/strong>AEP Foundation grant to Purdue Fort Wayne paves way to enhanced STEAM teacher training<\/li>\n<li>Three-year, $300,000 funding makes Project EZ:&nbsp;Green STEAM Tech possible<\/li>\n<li>Middle and high school teachers invited to learn more and apply<\/li>\n<li>STEAM acronym stands for science, technology, engineering, arts, and math<\/li>\n<\/ul>",
		"baseType": "CONTENT",
		"archived": false,
		"showLastModified": "",
		"averageRating": 0,
		"working": true,
		"newsAndEventsWidgetImage": "",
		"departments": "Educational Studies, Professional Studies",
		"imagePhotographer1": "",
		"live": true,
		"imagePhotographer2": "",
		"numberOfVotes": 0,
		"topMess": "1",
		"topics": "Education",
		"languageId": 1,
		"newsAndEventsWidgetLeadText": "A $300,000 grant from the AEP Foundation paves the way to enhanced professional development for teachers who specialize in science, technology, engineering, arts, and math.",
		"url": "",
		"titleImage": "Image",
		"imagePhotographer": "",
		"imageCaption2": "",
		"imageCaption1": ""
	}, {
		"newsAndEventsWidgetEnable": false,
		"pr": "PR",
		"Image": "",
		"doesNotExpire": "Yes",
		"imageCaption": "Students work together to design and improve a flexible cast as part of the engineering design process in the Human Body module.",
		"locked": false,
		"contentType": "newsItem",
		"newsAndEventsWidgetHeadline": "",
		"audience": "Home, Alumni & Friends, Prospective Students, Current Students, Faculty & Staff",
		"additionalImage1": "",
		"NewsPublishDate": "2020-01-21 10:38:00.0",
		"additionalImage2": "",
		"NewsSummary": "FORT WAYNE, Ind.—Purdue University Fort Wayne students in the preservice classroom teacher training program are the first in northeast Indiana who are receiving instruction and certification in the Project Lead the Way Launch platform before they graduate.",
		"numberOfVotes1": 0,
		"hasTitleImage": true,
		"sortOrder": 0,
		"averageRating1": 0,
		"NewsBody": "<p>FORT WAYNE, Ind.&mdash;Purdue University Fort Wayne students in the preservice classroom teacher training program are the first in northeast Indiana who are receiving instruction and certification in the Project Lead the Way (PLTW) Launch platform before they graduate.<\/p>\n<p>Matthew Perkins Coppola, assistant professor of science education, and Jeff Nowak, professor of science education, led the first session of instruction for the 30 students, who are coenrolled in elementary science methods, last week. Another session will be held this week on Wednesday, January 22.<\/p>\n<p>The PLTW Launch curriculum is composed of customizable 10-hour, standards-based modules in grades pre-K through 5. Each module follows a specific theme as it integrates principles of science, engineering, and computer science to provide a hands-on, project-based approach.<\/p>\n<p>&ldquo;This partnership positions us to better prepare our teacher candidates to teach STEM at the elementary school level,&rdquo; says Perkins Coppola. &ldquo;Those who are familiar with PLTW Launch testify to the impact it has had on students and teachers. They are very excited for this opportunity to learn how to include engineering, biomedical science, and computer science topics in their future classrooms.&rdquo;<\/p>\n<p>A grant from the Indiana Commission for Higher Education is covering the cost of the program and the instruction sessions.<\/p>\n<p>Several elementary schools in northeast Indiana have already adopted the PTWL curriculum, including Southwest Allen, East Allen, East Noble, Huntington, Adams Central, Whitko, and Warsaw.<\/p>\n<p>For more information on the program, contact Perkins Coppola at&nbsp;<a href=\"mailto:perkinsm@pfw.edu\">perkinsm@pfw.edu<\/a> or 260-481-6516.<\/p>",
		"modDate": "2020-01-21 10:40:19.105",
		"NewsHeadline": "Purdue University Fort Wayne Elementary Education Majors to Receive Project Lead the Way Preservice Certification",
		"commentscount": "0",
		"title": "Purdue University Fort Wayne Elementary Education Majors to Receive Project Lead the Way Preservice Certification",
		"keyInfo": "<ul>\n<li>Project Lead the Way Launch<\/li>\n<li>New way to teach STEM to Pre K&ndash;5th grades<\/li>\n<li>Elementary ed majors get instruction and certification<\/li>\n<li>First preservice teachers to do this in northeast&nbsp;Indiana<\/li>\n<\/ul>",
		"baseType": "CONTENT",
		"archived": false,
		"showLastModified": "",
		"averageRating": 0,
		"working": true,
		"newsAndEventsWidgetImage": "",
		"departments": "Educational Studies, Professional Studies",
		"imagePhotographer1": "",
		"live": true,
		"imagePhotographer2": "",
		"numberOfVotes": 0,
		"topMess": "1",
		"topics": "Education",
		"languageId": 1,
		"newsAndEventsWidgetLeadText": "",
		"url": "",
		"titleImage": "Image",
		"imagePhotographer": "",
		"imageCaption2": "Practicing unplugged programming as part of the Grids and Games module.",
		"imageCaption1": "Learning about block programming in the Scratch Jr. app"
	}, {
		"newsAndEventsWidgetEnable": false,
		"pr": "PR",
		"Image": "",
		"doesNotExpire": "Yes",
		"imageCaption": "Chef Alessia Uccellini",
		"locked": false,
		"contentType": "newsItem",
		"newsAndEventsWidgetHeadline": "",
		"audience": "Home, Alumni & Friends, Faculty & Staff",
		"additionalImage1": "",
		"NewsPublishDate": "2019-11-08 11:10:00.0",
		"additionalImage2": "",
		"NewsSummary": "FORT WAYNE, Ind.—Chef Alessia Uccellini is making her third trip to Purdue University Fort Wayne that will feature her knowledge of foods from the 15th and 16th centuries as she prepares a “Renaissance Dinner: Italian Food Through the Ages,” on Thursday, November 14.",
		"numberOfVotes1": 0,
		"hasTitleImage": true,
		"sortOrder": 0,
		"averageRating1": 0,
		"NewsBody": "<p>FORT WAYNE, Ind.&mdash;Chef Alessia Uccellini is making her third trip to Purdue University Fort Wayne that will feature her knowledge of foods from the 15th and 16th centuries as she prepares a &ldquo;Renaissance Dinner: Italian Food Through the Ages,&rdquo; on Thursday, November 14.<\/p>\n<p>The banquet, which is sponsored by the Department of Hotel and Tourism Management (HTM) in the College of Professional Studies, will be held at the Holiday Inn at Purdue Fort Wayne, beginning at 6 p.m. Students in the Food and Beverage Management class&nbsp;and other HTM students with extensive industry experience&nbsp;will&nbsp;assist&nbsp;the chef with the meal preparation, while the waitstaff will consist of other students in the department.<\/p>\n<p>The meal will begin with an appetizer of fried pasta and olives, followed by a first course of butternut squash soup with handmade ricotta and spinach ravioli in browned butter and sage sauce and pecorino. The second, or main course, will feature&nbsp;roasted pork butt with fennel, garlic, and pepper or a vegetarian souffl&eacute;. Side dishes include green beans, carrots, and\/or roasted winter vegetables. The first and second courses will also feature homemade breads reminiscent of the Renaissance. The third, or dessert course, will feature&nbsp;crepes with ice cream and berry sauce.<\/p>\n<p>Uccellini first visited the university in October 2017 and taught students&nbsp;the finer points of preparing ravioli. In 2018 she taught students how to make several other types of pasta.<\/p>\n<p>&ldquo;She&rsquo;s very passionate about cooking and making personal connections with everyone she meets,&rdquo; says Nathanael Falater, a senior in the HTM program. &ldquo;It was a pleasure to work with someone so humble and well-regarded in the international culinary community.&rdquo;<\/p>\n<p>Another feature of the evening will be a silent auction, with all proceeds going to the Department of Hospitality and Tourism Management. Items up for bid include offerings from DeBrand Fine Chocolates, the Olive Twist, Fort Wayne Children&rsquo;s Choir, a trip to Catalina Island, and more.<\/p>\n<p>Tickets for the four-course dinner are $40 per person for the general public, and $25 for students and are available <a href=\"https:\/\/tweb1.pfw.edu\/C20091_ustores\/web\/store_main.jsp?STOREID=63&amp;SINGLESTORE=true\">online<\/a> until Tuesday, November 12. There will also be a cash wine bar that will feature wines paired with each course. Guests can purchase drink tickets at the door.<\/p>\n<p>For more information about the banquet, contact Michellie Hannah at <a href=\"mailto:hannmc01@pfw.edu\">hannmc01@pfw.edu<\/a>.<\/p>",
		"modDate": "2019-11-08 11:17:43.539",
		"NewsHeadline": "Hotel and Tourism Management at Purdue University Fort Wayne Hosts Renaissance Banquet Prepared by Famed Italian Chef",
		"commentscount": "0",
		"title": "Hotel and Tourism Management at Purdue University Fort Wayne Hosts Renaissance Banquet Prepared by Famed Italian Chef",
		"keyInfo": "<ul>\n<li>Renaissance Banquet<\/li>\n<li>Thursday, November 14<\/li>\n<li>6 to 9 p.m.<\/li>\n<li>Holiday Inn at Purdue Fort Wayne<\/li>\n<\/ul>",
		"baseType": "CONTENT",
		"archived": false,
		"showLastModified": "",
		"averageRating": 0,
		"working": true,
		"newsAndEventsWidgetImage": "",
		"departments": "Professional Studies",
		"imagePhotographer1": "",
		"live": true,
		"imagePhotographer2": "",
		"numberOfVotes": 0,
		"topMess": "1",
		"topics": "General",
		"languageId": 1,
		"newsAndEventsWidgetLeadText": "",
		"url": "",
		"titleImage": "Image",
		"imagePhotographer": "",
		"imageCaption2": "",
		"imageCaption1": ""
	}, {
		"newsAndEventsWidgetEnable": false,
		"pr": "PR",
		"Image": "",
		"doesNotExpire": "Yes",
		"imageCaption": "Isabel Nuñez",
		"locked": false,
		"contentType": "newsItem",
		"newsAndEventsWidgetHeadline": "School of Education Recognized for National Excellence in Educator Prep",
		"audience": "Home, Alumni & Friends, Prospective Students, Faculty & Staff",
		"additionalImage1": "",
		"NewsPublishDate": "2019-07-29 13:30:00.0",
		"additionalImage2": "",
		"NewsSummary": "FORT WAYNE, Ind.—The Council for the Accreditation of Educator Preparation (CAEP) recently announced that Purdue University Fort Wayne’s School of Education is one of 42 providers from 23 states and the District of Columbia to receive accreditation for their educator preparation programs.",
		"numberOfVotes1": 0,
		"hasTitleImage": true,
		"sortOrder": 0,
		"averageRating1": 0,
		"NewsBody": "<p>FORT WAYNE, Ind.&mdash;The Council for the Accreditation of Educator Preparation (CAEP) recently announced that Purdue University Fort Wayne&rsquo;s School of Education is one of 42 providers from 23 states and the District of Columbia to receive accreditation for their educator preparation programs (EPPs). The spring 2019 review by the CAEP Accreditation Council resulted in 42 newly accredited EPPs, bringing the total to 238 providers approved under the CAEP Teacher Preparation Standards&mdash;rigorous, nationally recognized standards that were developed to ensure excellence in educator preparation programs.<\/p>\n<p>&ldquo;These institutions meet high standards so that their students receive an education that prepares them to succeed in a diverse range of classrooms after they graduate,&rdquo; says CAEP President Christopher A. Koch. &ldquo;Seeking CAEP Accreditation is a significant commitment on the part of an educator preparation provider.&rdquo;<\/p>\n<p>James Burg, dean of Purdue Fort Wayne&rsquo;s College of Professional Studies, says while the process of accreditation can be long and sometimes challenging, it is well worth it. &ldquo;Our students want to know that they are getting the best possible education to be the teachers of our future leaders,&rdquo; says Burg. &ldquo;They know when they see the CAEP accreditation badge on our website&nbsp;that they will get that preparation at Purdue Fort Wayne.&rdquo;<\/p>\n<p>Isabel Nu&ntilde;ez, professor of educational studies and director of the School of Education, is pleased the hard work of the faculty is recognized with the accreditation. &ldquo;In awarding our programs accreditation, CAEP has recognized the commitment of faculty in the School of Education to preparing inspirational and effective educators,&rdquo; she says.&nbsp;&ldquo;Every professor cares deeply about our students and their success.&nbsp;This achievement reflects their hard work in ensuring our future teachers, administrators, and counselors embark on their vocations with competence, confidence, and joy.&rdquo;<\/p>\n<p>CAEP is the sole nationally recognized accrediting body for educator preparation. Accreditation is a nongovernmental activity based on peer review that serves the dual functions of assuring quality and promoting improvement. CAEP was created by the consolidation of the National Council for Accreditation of Teacher Education and the Teacher Education Accreditation Council. It is a unified accreditation system intent on raising the performance of all institutions focused on educator preparation.<\/p>\n<p>For additional information, contact Susan Alderman, at 260-481-6165 (office), 260-489-5349 (cell), or <a href=\"mailto:susan.alderman@pfw.edu\">susan.alderman@pfw.edu <\/a><\/p>",
		"modDate": "2019-09-04 16:06:54.252",
		"NewsHeadline": "Purdue University Fort Wayne’s School of Education Recognized for National Excellence in Educator Prep",
		"commentscount": "0",
		"title": "Purdue University Fort Wayne’s School of Education Recognized for National Excellence in Educator Prep",
		"keyInfo": "<ul>\n<li>Purdue Fort Wayne&rsquo;s School of Education receives accreditation<\/li>\n<li>One&nbsp;of 42 to receive educator preparation program recognition<\/li>\n<li>Council for the Accreditation of Educator Preparation conducted review<\/li>\n<\/ul>",
		"baseType": "CONTENT",
		"archived": false,
		"showLastModified": "",
		"averageRating": 0,
		"working": true,
		"newsAndEventsWidgetImage": "",
		"departments": "Educational Studies, Professional Studies",
		"imagePhotographer1": "",
		"live": true,
		"imagePhotographer2": "",
		"numberOfVotes": 0,
		"topMess": "1",
		"topics": "Education",
		"languageId": 1,
		"newsAndEventsWidgetLeadText": "The Council for the Accreditation of Educator Preparation has announced that our School of Education is one of 42 providers to receive accreditation for their educator preparation programs.",
		"url": "",
		"titleImage": "Image",
		"imagePhotographer": "",
		"imageCaption2": "",
		"imageCaption1": "James Burg"
	}]
}